In [448]:
import pandas as pd
import numpy as np
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline
import plotly.offline as py
py.init_notebook_mode(connected=True)
import plotly.graph_objs as go
import plotly.tools as tls
import seaborn as sns
import time
import warnings
warnings.filterwarnings('ignore')

# Problem Statement-1
 analyze the change in temperatures across globe from the 17th century till now

### Importing CSV File

In [449]:
ls

 Volume in drive C is ssd
 Volume Serial Number is 344C-651C

 Directory of C:\Users\phoneclicker\Downloads\excelr_kd\project on aggriculture

02/16/2023  04:27 PM    <DIR>          .
02/16/2023  04:27 PM    <DIR>          ..
01/19/2023  09:37 AM    <DIR>          .ipynb_checkpoints
01/17/2023  03:57 PM            50,208 a4039245-21ac-4e87-b3be-45a2e1803744.pdf
02/16/2023  04:27 PM           134,237 Analyzing Climate Change.ipynb
01/17/2023  12:07 PM           374,263 Analyzing Climate Change.pdf
02/16/2023  04:32 PM        27,562,776 Final_for.sav
02/16/2023  04:23 PM               895 forecast_kd.py
01/19/2023  09:34 AM       532,830,464 GlobalLandTemperaturesByCity.csv
01/19/2023  09:34 AM        22,680,393 GlobalLandTemperaturesByCountry.csv
01/19/2023  09:34 AM        14,138,385 GlobalLandTemperaturesByMajorCity.csv
01/19/2023  09:34 AM        30,770,160 GlobalLandTemperaturesByState.csv
01/18/2023  12:54 PM           205,875 GlobalTemperatures.csv
              10 File(s)    628,747,656 bytes
               3 Dir(s)  49,059,282,944 bytes free

In [450]:
main_data=pd.read_csv("GlobalLandTemperaturesByCountry.csv")

In [451]:
main_data

,dt,AverageTemperature,AverageTemperatureUncertainty,Country
0,1743-11-01,4.384,2.294,Åland
1,1743-12-01,NaN,NaN,Åland
2,1744-01-01,NaN,NaN,Åland
3,1744-02-01,NaN,NaN,Åland
4,1744-03-01,NaN,NaN,Åland
...,...,...,...,...
577457,2013-05-01,19.059,1.022,Zimbabwe
577458,2013-06-01,17.613,0.473,Zimbabwe
577459,2013-07-01,17.000,0.453,Zimbabwe
577460,2013-08-01,19.759,0.717,Zimbabwe
577461,2013-09-01,NaN,NaN,Zimbabwe

In [452]:
main_data["dt"]

0         1743-11-01
1         1743-12-01
2         1744-01-01
3         1744-02-01
4         1744-03-01
             ...
577457    2013-05-01
577458    2013-06-01
577459    2013-07-01
577460    2013-08-01
577461    2013-09-01
Name: dt, Length: 577462, dtype: object

In [453]:
main_data.isna().sum()

dt                                   0
AverageTemperature               32651
AverageTemperatureUncertainty    31912
Country                              0
dtype: int64

In [454]:
main_data.describe()

       AverageTemperature  AverageTemperatureUncertainty
count       544811.000000                  545550.000000
mean            17.193354                       1.019057
std             10.953966                       1.201930
min            -37.658000                       0.052000
25%             10.025000                       0.323000
50%             20.901000                       0.571000
75%             25.814000                       1.206000
max             38.842000                      15.003000

In [455]:
main_data.value_counts()

dt          AverageTemperature  AverageTemperatureUncertainty  Country
1743-11-01  -3.571              2.965                          Finland                     1
1951-02-01   23.783             0.272                          British Virgin Islands      1
             24.553             0.519                          Nicaragua                   1
             24.511             0.508                          Colombia                    1
             24.419             0.454                          Madagascar                  1
                                                                                          ..
1887-10-01   9.399              0.298                          Jersey                      1
                                                               Guernsey                    1
             9.326              0.583                          Croatia                     1
             9.174              0.766                          New Zealand                 1
2013-09-01   29.770             1.005                          Turks And Caicas Islands    1
Length: 544811, dtype: int64

In [456]:
np.unique(main_data["Country"])

array(['Afghanistan', 'Africa', 'Albania', 'Algeria', 'American Samoa',
       'Andorra', 'Angola', 'Anguilla', 'Antarctica',
       'Antigua And Barbuda', 'Argentina', 'Armenia', 'Aruba', 'Asia',
       'Australia', 'Austria', 'Azerbaijan', 'Bahamas', 'Bahrain',
       'Baker Island', 'Bangladesh', 'Barbados', 'Belarus', 'Belgium',
       'Belize', 'Benin', 'Bhutan', 'Bolivia',
       'Bonaire, Saint Eustatius And Saba', 'Bosnia And Herzegovina',
       'Botswana', 'Brazil', 'British Virgin Islands', 'Bulgaria',
       'Burkina Faso', 'Burma', 'Burundi', 'Cambodia', 'Cameroon',
       'Canada', 'Cape Verde', 'Cayman Islands',
       'Central African Republic', 'Chad', 'Chile', 'China',
       'Christmas Island', 'Colombia', 'Comoros', 'Congo',
       'Congo (Democratic Republic Of The)', 'Costa Rica', 'Croatia',
       'Cuba', 'Curaçao', 'Cyprus', 'Czech Republic', "Côte D'Ivoire",
       'Denmark', 'Denmark (Europe)', 'Djibouti', 'Dominica',
       'Dominican Republic', 'Ecuador', 'Egypt', 'El Salvador',
       'Equatorial Guinea', 'Eritrea', 'Estonia', 'Ethiopia', 'Europe',
       'Falkland Islands (Islas Malvinas)', 'Faroe Islands',
       'Federated States Of Micronesia', 'Fiji', 'Finland', 'France',
       'France (Europe)', 'French Guiana', 'French Polynesia',
       'French Southern And Antarctic Lands', 'Gabon', 'Gambia',
       'Gaza Strip', 'Georgia', 'Germany', 'Ghana', 'Greece', 'Greenland',
       'Grenada', 'Guadeloupe', 'Guam', 'Guatemala', 'Guernsey', 'Guinea',
       'Guinea Bissau', 'Guyana', 'Haiti',
       'Heard Island And Mcdonald Islands', 'Honduras', 'Hong Kong',
       'Hungary', 'Iceland', 'India', 'Indonesia', 'Iran', 'Iraq',
       'Ireland', 'Isle Of Man', 'Israel', 'Italy', 'Jamaica', 'Japan',
       'Jersey', 'Jordan', 'Kazakhstan', 'Kenya', 'Kingman Reef',
       'Kiribati', 'Kuwait', 'Kyrgyzstan', 'Laos', 'Latvia', 'Lebanon',
       'Lesotho', 'Liberia', 'Libya', 'Liechtenstein', 'Lithuania',
       'Luxembourg', 'Macau', 'Macedonia', 'Madagascar', 'Malawi',
       'Malaysia', 'Mali', 'Malta', 'Martinique', 'Mauritania',
       'Mauritius', 'Mayotte', 'Mexico', 'Moldova', 'Monaco', 'Mongolia',
       'Montenegro', 'Montserrat', 'Morocco', 'Mozambique', 'Namibia',
       'Nepal', 'Netherlands', 'Netherlands (Europe)', 'New Caledonia',
       'New Zealand', 'Nicaragua', 'Niger', 'Nigeria', 'Niue',
       'North America', 'North Korea', 'Northern Mariana Islands',
       'Norway', 'Oceania', 'Oman', 'Pakistan', 'Palau', 'Palestina',
       'Palmyra Atoll', 'Panama', 'Papua New Guinea', 'Paraguay', 'Peru',
       'Philippines', 'Poland', 'Portugal', 'Puerto Rico', 'Qatar',
       'Reunion', 'Romania', 'Russia', 'Rwanda', 'Saint Barthélemy',
       'Saint Kitts And Nevis', 'Saint Lucia', 'Saint Martin',
       'Saint Pierre And Miquelon', 'Saint Vincent And The Grenadines',
       'Samoa', 'San Marino', 'Sao Tome And Principe', 'Saudi Arabia',
       'Senegal', 'Serbia', 'Seychelles', 'Sierra Leone', 'Singapore',
       'Sint Maarten', 'Slovakia', 'Slovenia', 'Solomon Islands',
       'Somalia', 'South Africa', 'South America',
       'South Georgia And The South Sandwich Isla', 'South Korea',
       'Spain', 'Sri Lanka', 'Sudan', 'Suriname',
       'Svalbard And Jan Mayen', 'Swaziland', 'Sweden', 'Switzerland',
       'Syria', 'Taiwan', 'Tajikistan', 'Tanzania', 'Thailand',
       'Timor Leste', 'Togo', 'Tonga', 'Trinidad And Tobago', 'Tunisia',
       'Turkey', 'Turkmenistan', 'Turks And Caicas Islands', 'Uganda',
       'Ukraine', 'United Arab Emirates', 'United Kingdom',
       'United Kingdom (Europe)', 'United States', 'Uruguay',
       'Uzbekistan', 'Venezuela', 'Vietnam', 'Virgin Islands',
       'Western Sahara', 'Yemen', 'Zambia', 'Zimbabwe', 'Åland'],
      dtype=object)

In [457]:
main_data["Country"].value_counts()

Åland                                  3239
Faroe Islands                          3239
Greece                                 3239
Germany                                3239
Saint Pierre And Miquelon              3239
                                       ...
Northern Mariana Islands               1329
Guam                                   1329
Heard Island And Mcdonald Islands       788
French Southern And Antarctic Lands     788
Antarctica                              764
Name: Country, Length: 243, dtype: int64

# Feature Engineering

In [458]:
main_data_mod=main_data.dropna(inplace=False)

In [459]:
main_data_mod

,dt,AverageTemperature,AverageTemperatureUncertainty,Country
0,1743-11-01,4.384,2.294,Åland
5,1744-04-01,1.530,4.680,Åland
6,1744-05-01,6.702,1.789,Åland
7,1744-06-01,11.609,1.577,Åland
8,1744-07-01,15.342,1.410,Åland
...,...,...,...,...
577456,2013-04-01,21.142,0.495,Zimbabwe
577457,2013-05-01,19.059,1.022,Zimbabwe
577458,2013-06-01,17.613,0.473,Zimbabwe
577459,2013-07-01,17.000,0.453,Zimbabwe
577460,2013-08-01,19.759,0.717,Zimbabwe

In [460]:
main_data_mod["Country"].value_counts()

Åland                                  3166
Bulgaria                               3166
Romania                                3166
Poland                                 3166
Norway                                 3166
                                       ...
Federated States Of Micronesia         1364
Northern Mariana Islands               1328
Guam                                   1328
French Southern And Antarctic Lands     783
Heard Island And Mcdonald Islands       783
Name: Country, Length: 242, dtype: int64

In [461]:
main_data_mod.shape

(544811, 4)

In [462]:
main_data_mod.describe()

       AverageTemperature  AverageTemperatureUncertainty
count       544811.000000                  544811.000000
mean            17.193354                       1.019190
std             10.953966                       1.202634
min            -37.658000                       0.052000
25%             10.025000                       0.323000
50%             20.901000                       0.571000
75%             25.814000                       1.207000
max             38.842000                      15.003000

In [463]:
main_data_mod.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 544811 entries, 0 to 577460
Data columns (total 4 columns):
 #   Column                         Non-Null Count   Dtype
---  ------                         --------------   -----
 0   dt                             544811 non-null  object
 1   AverageTemperature             544811 non-null  float64
 2   AverageTemperatureUncertainty  544811 non-null  float64
 3   Country                        544811 non-null  object
dtypes: float64(2), object(2)
memory usage: 20.8+ MB

# Seprating  the Data

# "year"

In [464]:
sep_data = main_data_mod[['dt','AverageTemperature']]

In [465]:
sep_data.head()

           dt  AverageTemperature
0  1743-11-01               4.384
5  1744-04-01               1.530
6  1744-05-01               6.702
7  1744-06-01              11.609
8  1744-07-01              15.342

In [466]:
year = main_data_mod[['dt']]

In [467]:
year

                dt
0       1743-11-01
5       1744-04-01
6       1744-05-01
7       1744-06-01
8       1744-07-01
...            ...
577456  2013-04-01
577457  2013-05-01
577458  2013-06-01
577459  2013-07-01
577460  2013-08-01

[544811 rows x 1 columns]

In [468]:
year1=pd.to_datetime(year["dt"]).dt.year

In [469]:
year1

0         1743
5         1744
6         1744
7         1744
8         1744
          ...
577456    2013
577457    2013
577458    2013
577459    2013
577460    2013
Name: dt, Length: 544811, dtype: int64

In [470]:
d={"dt"}
year=pd.DataFrame(data=year1,columns=d)

In [471]:
year

          dt
0       1743
5       1744
6       1744
7       1744
8       1744
...      ...
577456  2013
577457  2013
577458  2013
577459  2013
577460  2013

[544811 rows x 1 columns]

# average temprature

In [472]:
avg_temp=sep_data[["AverageTemperature"]]
avg_temp

        AverageTemperature
0                    4.384
5                    1.530
6                    6.702
7                   11.609
8                   15.342
...                    ...
577456              21.142
577457              19.059
577458              17.613
577459              17.000
577460              19.759

[544811 rows x 1 columns]

# adding year and avg temp in one data frame

In [473]:
year["AverageTemperature"]=avg_temp

In [474]:
avg_year=year

In [475]:
avg_year

          dt  AverageTemperature
0       1743               4.384
5       1744               1.530
6       1744               6.702
7       1744              11.609
8       1744              15.342
...      ...                 ...
577456  2013              21.142
577457  2013              19.059
577458  2013              17.613
577459  2013              17.000
577460  2013              19.759

[544811 rows x 2 columns]

# GroupBy From Year

In [476]:
avg_year_group=avg_year.groupby("dt").mean()

In [477]:
avg_year_group

      AverageTemperature
dt
1743            5.184140
1744            9.837898
1745            1.387125
1750            9.129353
1751            9.167388
...                  ...
2009           19.546385
2010           19.629806
2011           19.456040
2012           19.468744
2013           19.877007

[267 rows x 1 columns]

# Plot.1

In [478]:
#avg_year_group.plot(figsize=(16,4))

In [479]:
x=year["dt"]
y=avg_temp["AverageTemperature"]
#plt.figure(figsize=(15,5))
#plt.bar(x,y)
#print(x.shape)
#print(y.shape)

In [480]:
#plt.hist(avg_year_group,bins=30, histtype='bar')

In [481]:
#plt.scatter(x,y, s=2,c="blue",marker="*")

# Group By Countries Horizontal Graph

In [482]:
main_data_mod=main_data.dropna(inplace=False)

In [483]:
data=main_data.groupby("Country").mean()

In [484]:
data.head()

                AverageTemperature  AverageTemperatureUncertainty
Country
Afghanistan              14.045007                       0.930162
Africa                   24.074203                       0.395564
Albania                  12.610646                       1.524574
Algeria                  22.985112                       1.176241
American Samoa           26.611965                       0.541258

In [485]:
data.index

Index(['Afghanistan', 'Africa', 'Albania', 'Algeria', 'American Samoa',
       'Andorra', 'Angola', 'Anguilla', 'Antarctica', 'Antigua And Barbuda',
       ...
       'Uruguay', 'Uzbekistan', 'Venezuela', 'Vietnam', 'Virgin Islands',
       'Western Sahara', 'Yemen', 'Zambia', 'Zimbabwe', 'Åland'],
      dtype='object', name='Country', length=243)

In [486]:
mean_temp=data["AverageTemperature"]

countries=data.index

In [487]:
'''
mean_temp_bar, countries_bar = (list(x) for x in zip(*sorted(zip(mean_temp, countries), 
                                                             reverse = True)))
sns.set(font_scale=0.9) 
f, ax = plt.subplots(figsize=(4.5, 50))
colors_cw = sns.color_palette('coolwarm', len(countries))
sns.barplot(mean_temp_bar, countries_bar, palette = colors_cw[::-1])
Text = ax.set(xlabel='Average temperature', title='Average land temperature in countries')

'''

"\nmean_temp_bar, countries_bar = (list(x) for x in zip(*sorted(zip(mean_temp, countries), \n                                                             reverse = True)))\nsns.set(font_scale=0.9) \nf, ax = plt.subplots(figsize=(4.5, 50))\ncolors_cw = sns.color_palette('coolwarm', len(countries))\nsns.barplot(mean_temp_bar, countries_bar, palette = colors_cw[::-1])\nText = ax.set(xlabel='Average temperature', title='Average land temperature in countries')\n\n"

# Data Frame

In [488]:
data.head(2)
data_temp_avg=data.reset_index()

In [489]:
data_temp_avg.head(3)

       Country  AverageTemperature  AverageTemperatureUncertainty
0  Afghanistan           14.045007                       0.930162
1       Africa           24.074203                       0.395564
2      Albania           12.610646                       1.524574

In [490]:
avg_year_group.head(4)

      AverageTemperature
dt
1743            5.184140
1744            9.837898
1745            1.387125
1750            9.129353

In [491]:
avg_year_group

      AverageTemperature
dt
1743            5.184140
1744            9.837898
1745            1.387125
1750            9.129353
1751            9.167388
...                  ...
2009           19.546385
2010           19.629806
2011           19.456040
2012           19.468744
2013           19.877007

[267 rows x 1 columns]

# Density Plot

In [492]:
#avg_year_group.plot(kind='kde')

# Problem Statement -2
Building a multivariate deep learning-based time series model to forecast the U.S. Average
temperature

In [493]:
ls

 Volume in drive C is ssd
 Volume Serial Number is 344C-651C

 Directory of C:\Users\phoneclicker\Downloads\excelr_kd\project on aggriculture

02/16/2023  04:27 PM    <DIR>          .
02/16/2023  04:27 PM    <DIR>          ..
01/19/2023  09:37 AM    <DIR>          .ipynb_checkpoints
01/17/2023  03:57 PM            50,208 a4039245-21ac-4e87-b3be-45a2e1803744.pdf
02/16/2023  04:27 PM           134,237 Analyzing Climate Change.ipynb
01/17/2023  12:07 PM           374,263 Analyzing Climate Change.pdf
02/16/2023  04:32 PM        27,562,776 Final_for.sav
02/16/2023  04:23 PM               895 forecast_kd.py
01/19/2023  09:34 AM       532,830,464 GlobalLandTemperaturesByCity.csv
01/19/2023  09:34 AM        22,680,393 GlobalLandTemperaturesByCountry.csv
01/19/2023  09:34 AM        14,138,385 GlobalLandTemperaturesByMajorCity.csv
01/19/2023  09:34 AM        30,770,160 GlobalLandTemperaturesByState.csv
01/18/2023  12:54 PM           205,875 GlobalTemperatures.csv
              10 File(s)    628,747,656 bytes
               3 Dir(s)  49,059,287,040 bytes free

In [494]:
main_data2=pd.read_csv("GlobalLandTemperaturesByCountry.csv")

In [495]:
main_data2.head(2)

           dt  AverageTemperature  AverageTemperatureUncertainty Country
0  1743-11-01               4.384                          2.294   Åland
1  1743-12-01                 NaN                            NaN   Åland

In [496]:
usa1=main_data2[main_data2['Country']=='United States']

In [497]:
usa1.shape

(2941, 4)

In [498]:
usa2=usa1.drop("AverageTemperatureUncertainty",axis=1)

In [499]:
usa2=usa2.dropna()

In [500]:
usa2.shape

(2482, 3)

In [501]:
usa2.head(3)

                dt  AverageTemperature        Country
554880  1768-09-01              15.420  United States
554881  1768-10-01               8.162  United States
554882  1768-11-01               1.591  United States

In [502]:
usa3=usa2.drop("Country",axis=1)

In [503]:
usa3.head(2)

                dt  AverageTemperature
554880  1768-09-01              15.420
554881  1768-10-01               8.162

In [504]:
usa4=usa3.set_index("dt")

In [505]:
usa4.head(3)

            AverageTemperature
dt
1768-09-01              15.420
1768-10-01               8.162
1768-11-01               1.591

In [506]:
#sns.lineplot(x=usa4.index,y=usa4['AverageTemperature'])

In [507]:
from statsmodels.tsa.stattools import adfuller

In [508]:
test_result=adfuller(usa4['AverageTemperature'])

In [509]:
def adfuller_test(AverageTemperature):
    result=adfuller(AverageTemperature)
    labels = ['ADF Test Statistic','p-value','#Lags Used','Number of Observations Used']
    for value,label in zip(result,labels):
        print(label+' : '+str(value) )
    if result[1] <= 0.05:
        print("strong evidence against the null hypothesis(Ho), reject the null hypothesis. Data has no unit root and is stationary")
    else:
        print("weak evidence against null hypothesis, time series has a unit root, indicating it is non-stationary ")

In [510]:
adfuller_test(usa4['AverageTemperature'])

ADF Test Statistic : -5.2772426021791015
p-value : 6.102382844119769e-06
#Lags Used : 27
Number of Observations Used : 2454
strong evidence against the null hypothesis(Ho), reject the null hypothesis. Data has no unit root and is stationary

In [511]:
#usa4[['AverageTemperature']].plot(figsize=(30,15))

In [512]:
usa5=usa4.reset_index()

In [513]:
month=pd.to_datetime(usa5["dt"]).dt.month
year=pd.to_datetime(usa5["dt"]).dt.year

In [514]:
usa5

              dt  AverageTemperature
0     1768-09-01              15.420
1     1768-10-01               8.162
2     1768-11-01               1.591
3     1768-12-01              -2.882
4     1769-01-01              -3.952
...          ...                 ...
2477  2013-05-01              14.073
2478  2013-06-01              20.198
2479  2013-07-01              22.074
2480  2013-08-01              21.168
2481  2013-09-01              18.273

[2482 rows x 2 columns]

In [515]:
usa5['month']=month
usa5['year']=year
usa5

              dt  AverageTemperature  month  year
0     1768-09-01              15.420      9  1768
1     1768-10-01               8.162     10  1768
2     1768-11-01               1.591     11  1768
3     1768-12-01              -2.882     12  1768
4     1769-01-01              -3.952      1  1769
...          ...                 ...    ...   ...
2477  2013-05-01              14.073      5  2013
2478  2013-06-01              20.198      6  2013
2479  2013-07-01              22.074      7  2013
2480  2013-08-01              21.168      8  2013
2481  2013-09-01              18.273      9  2013

[2482 rows x 4 columns]

In [516]:
pivot=usa5.pivot_table(values='AverageTemperature',index='month',columns='year')
pivot

year,1768,1769,1774,1775,1776,1777,1778,1779,1781,1782,...,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013
month,,,,,,,,,,,,,,,,,,,,,
1,NaN,-3.952,NaN,-1.551,-6.358,0.174,-3.402,-5.338,NaN,-5.980,...,-3.841,-1.884,-0.287,-2.959,-3.883,-3.569,-3.610,-3.507,-2.268,-2.155
2,NaN,-2.684,NaN,1.506,-0.540,-0.186,NaN,-0.293,NaN,-4.058,...,-1.427,0.408,-0.574,-2.240,-1.586,-0.310,-2.105,-1.881,0.582,-1.216
3,NaN,1.828,NaN,5.020,1.541,2.504,NaN,3.490,NaN,-0.121,...,5.178,3.548,2.794,4.446,2.828,2.833,3.436,3.462,6.024,2.289
4,NaN,8.843,NaN,7.663,7.254,5.836,NaN,NaN,NaN,8.792,...,9.388,8.797,9.850,8.476,7.902,8.172,9.550,8.582,10.196,6.970
5,NaN,15.724,NaN,14.452,NaN,13.739,13.835,NaN,NaN,14.020,...,15.247,14.204,15.155,15.101,13.723,14.884,14.174,13.759,15.422,14.073
6,NaN,20.933,NaN,17.684,19.836,17.463,16.855,NaN,NaN,19.578,...,19.228,19.511,19.933,19.705,19.381,18.962,19.885,19.578,19.954,20.198
7,NaN,22.093,NaN,21.601,20.940,19.176,NaN,NaN,NaN,21.014,...,21.663,22.478,22.911,22.352,21.690,21.463,22.078,22.722,23.008,22.074
8,NaN,20.787,NaN,20.844,21.476,19.398,NaN,NaN,NaN,NaN,...,20.175,21.353,21.079,22.118,20.543,20.436,21.703,21.915,21.422,21.168
9,15.420,NaN,NaN,15.081,14.999,15.270,NaN,NaN,14.316,NaN,...,16.468,17.730,15.992,17.365,16.567,17.167,17.384,17.148,17.036,18.273
10,8.162,NaN,9.244,10.256,8.351,7.042,8.203,NaN,9.031,NaN,...,10.670,10.489,9.608,10.932,9.164,8.534,10.913,10.490,9.688,NaN
11,1.591,NaN,0.522,5.371,2.703,1.882,0.630,NaN,3.832,NaN,...,4.191,3.650,3.400,4.502,3.620,4.251,3.601,2.966,3.330,NaN
12,-2.882,NaN,-4.957,-3.937,-0.992,-2.641,-3.949,NaN,-2.166,NaN,...,-0.930,-1.572,-0.167,-1.748,-2.532,-3.178,-2.942,-0.635,-1.261,NaN

In [517]:
'''
pivot.plot(figsize=(20,6))
plt.legend().remove()
plt.xlabel('Months')
plt.ylabel('Temperatures')

'''

"\npivot.plot(figsize=(20,6))\nplt.legend().remove()\nplt.xlabel('Months')\nplt.ylabel('Temperatures')\n\n"

In [518]:
'''

monthly_seasonality=pivot.mean(axis=1)
monthly_seasonality.plot(figsize=(20,6))
usa5.head()

'''

'\n\nmonthly_seasonality=pivot.mean(axis=1)\nmonthly_seasonality.plot(figsize=(20,6))\nusa5.head()\n\n'

In [519]:
usa5

              dt  AverageTemperature  month  year
0     1768-09-01              15.420      9  1768
1     1768-10-01               8.162     10  1768
2     1768-11-01               1.591     11  1768
3     1768-12-01              -2.882     12  1768
4     1769-01-01              -3.952      1  1769
...          ...                 ...    ...   ...
2477  2013-05-01              14.073      5  2013
2478  2013-06-01              20.198      6  2013
2479  2013-07-01              22.074      7  2013
2480  2013-08-01              21.168      8  2013
2481  2013-09-01              18.273      9  2013

[2482 rows x 4 columns]

In [520]:
usa5=usa5.set_index("dt")

In [521]:
usa5=usa5[['AverageTemperature']]
usa5.head()

            AverageTemperature
dt
1768-09-01              15.420
1768-10-01               8.162
1768-11-01               1.591
1768-12-01              -2.882
1769-01-01              -3.952

In [522]:
usa5.shape

(2482, 1)

# Smoothning your Time Series data

In [523]:
usa5['AverageTemperature'].rolling(window=3).mean()

dt
1768-09-01          NaN
1768-10-01          NaN
1768-11-01     8.391000
1768-12-01     2.290333
1769-01-01    -1.747667
                ...
2013-05-01     7.777333
2013-06-01    13.747000
2013-07-01    18.781667
2013-08-01    21.146667
2013-09-01    20.505000
Name: AverageTemperature, Length: 2482, dtype: float64

In [524]:
value=pd.DataFrame(usa5['AverageTemperature'])
temp_df=pd.concat([value,usa5['AverageTemperature'].rolling(window=3).mean()],axis=1)
temp_df.columns=['actual_temp','forecast_temp']
temp_df.head(10)

            actual_temp  forecast_temp
dt
1768-09-01       15.420            NaN
1768-10-01        8.162            NaN
1768-11-01        1.591       8.391000
1768-12-01       -2.882       2.290333
1769-01-01       -3.952      -1.747667
1769-02-01       -2.684      -3.172667
1769-03-01        1.828      -1.602667
1769-04-01        8.843       2.662333
1769-05-01       15.724       8.798333
1769-06-01       20.933      15.166667

In [525]:
from sklearn.metrics import mean_squared_error

In [526]:
np.sqrt(mean_squared_error(temp_df['forecast_temp'][2:],temp_df['actual_temp'][2:]))

4.560847359331975

# Lets Implement ARIMA

In [527]:


from statsmodels.graphics.tsaplots import plot_acf,plot_pacf
usa5.head()

            AverageTemperature
dt
1768-09-01              15.420
1768-10-01               8.162
1768-11-01               1.591
1768-12-01              -2.882
1769-01-01              -3.952

In [528]:


#plot_acf(usa5['AverageTemperature'].dropna())

In [529]:
#plot_pacf(usa5['AverageTemperature'].dropna())

In [530]:
usa5.shape

(2482, 1)

In [531]:
training_data=usa5[0:2000]
### create test that is basically unseen to our model, or which is basocally is used for evalaution
test_data=usa5[2000:]

In [532]:
from statsmodels.tsa.arima.model import ARIMA

In [533]:
arima=ARIMA(training_data,order=(2,1,7))

model=arima.fit()

predictions=model.forecast(steps=len(test_data))

np.sqrt(mean_squared_error(test_data,predictions))

2.7176688304787104

# Hyperparameter Tuning or choosing the best pair of (p,d,q)

In [534]:
"""

p=2
d=1
q=7
predictions=[]
order=(p,d,q)
train=usa5[0:2000]
test=usa5[2000:]
#arima=ARIMA(endog=train,order=(p,d,q))
arima=ARIMA(training_data,order=(5,1,7))
model=arima.fit()
pred=model.forecast(steps=len(test))
predictions.append(pred)
error=mean_squared_error(test,predictions)
print('MSE is {} with order {}'.format(error,order))

"""
predictions=[]
order=(2,1,7)
arima=ARIMA(training_data, order=(2,1,7))

model=arima.fit()

predictions=model.forecast(steps=len(test_data))

predictions.append(predictions)
error=np.sqrt(mean_squared_error(test_data,predictions))
print('MSE is {} with order {}'.format(error,order))

MSE is 2.7176688304787104 with order (2, 1, 7)

In [535]:

pred=predictions.reset_index()
pred

     index  predicted_mean
0     2000       20.117889
1     2001       15.748393
2     2002        9.459199
3     2003        3.100104
4     2004       -1.669900
..     ...             ...
477   2477       11.737297
478   2478       14.406481
479   2479       15.555787
480   2480       14.881522
481   2481       12.568689

[482 rows x 2 columns]

In [538]:
forecasting=pd.DataFrame.rename(pred,columns={"index":"year","predicted_mean":"avg_temprature"})

In [539]:
forecasting

     year  avg_temprature
0    2000       20.117889
1    2001       15.748393
2    2002        9.459199
3    2003        3.100104
4    2004       -1.669900
..    ...             ...
477  2477       11.737297
478  2478       14.406481
479  2479       15.555787
480  2480       14.881522
481  2481       12.568689

[482 rows x 2 columns]

In [540]:
forcast=forecasting.set_index("year")

In [541]:
forcast

      avg_temprature
year
2000       20.117889
2001       15.748393
2002        9.459199
2003        3.100104
2004       -1.669900
...              ...
2477       11.737297
2478       14.406481
2479       15.555787
2480       14.881522
2481       12.568689

[482 rows x 1 columns]

# pickle file

In [542]:
import pickle
# creating a pickle file
filename = 'Final_for.sav'
pickle.dump(model,open(filename, 'wb'))

In [543]:
# loading the saved model 
loaded_model = pickle.load(open('Final_for.sav','rb'))

In [576]:
predictions=[]
predictions=loaded_model.forecast(steps=len(test_data))
predictions.append(predictions)
pred=predictions.reset_index()
forecasting=pd.DataFrame.rename(pred,columns={"index":"year","predicted_mean":"avg_temprature"})
forcast=forecasting.set_index("year")

      avg_temprature
year
2000       20.117889
2001       15.748393
2002        9.459199
2003        3.100104
2004       -1.669900
...              ...
2477       11.737297
2478       14.406481
2479       15.555787
2480       14.881522
2481       12.568689

[482 rows x 1 columns]

In [584]:
forcast['avg_temprature'][2001]

15.748393413613938

In [ ]:
input_data = pd.DataFrame({'year': [year]})

In [573]:
predictions

2000    20.117889
2001    15.748393
2002     9.459199
2003     3.100104
2004    -1.669900
          ...
2477    11.737297
2478    14.406481
2479    15.555787
2480    14.881522
2481    12.568689
Name: predicted_mean, Length: 482, dtype: float64

In [551]:
import streamlit as st
import pandas as pd
import pickle

# load the saved model from the .sav file
with open('Final_for.sav', 'rb') as file:
    model = pickle.load(file)

# function to get the temperature prediction for a given year
def predict_temperature(year):
    # create a DataFrame with the input year as a single row
    input_data = pd.DataFrame({'year': [year]})

    # use the model to make a single prediction for the input year
    prediction = model.forecast(steps=len(input_data), exog=input_data)

    # return the predicted temperature as a float
    return prediction

# create a Streamlit app
st.title('Temperature Prediction')
year = st.number_input('Enter a year:', min_value=2000, max_value=2482, step=1)
if st.button('Predict'):
    temperature = predict_temperature(year)
    st.write(f'The predicted temperature for {year} is {temperature:.2f} degrees.')